Repository: GNOME/dasher
Catalog: Data/Help/Gnome/*/*.po
Languages: sv

# _
source: translator-credits
sv: Daniel Nylander <po@danielnylander.se>, 2006, 2009 Josef Andersson <l10nl18nsweja@gmail.com>, 2017 Anders Jonsson <anders.jonsson@norsjovallen.se>, 2020

source: Dasher Manual
sv: Handbok för Dasher

source: The Dasher Project
sv: Dasher-projektet

source: <year>2010</year> <holder>The Dasher Project</holder>
sv: <year>2010</year> <holder>Dasher-projektet</holder>

source: Permission is granted to make and distribute verbatim copies of this manual provided the copyright notice and this permission notice are preserved on all copies.
sv: Tillstånd ges att skapa och distribuera kopior av denna handbok förutsatt att upphovsrättsmeddelandet och detta rättighetsmeddelande bevaras i alla kopior.

source: Permission is granted to copy and distribute modified versions of this manual under the conditions for verbatim copying, provided that the entire resulting derived work is distributed under the terms of a permission notice identical to this one.
sv: Tillstånd att kopiera och distribuera modifierade versioner av denna handbok ges under villkoren för kopiering, förutsatt att hela det resulterande arbetet distribueras under identiska villkor.

source: Permission is granted to copy and distribute translations of this manual into another language, under the above conditions for modified versions, except that this permission notice may be stated in a translation approved by the Free Software Foundation.
sv: Tillstånd att kopiera och distribuera översättningar till andra språk av denna handbok ges under villkoren ovan för modifierade versioner, förutom att detta rättighetsmeddelande ska uttryckas i en översättning godkänd av Free Software Foundation.

source: UNIX is a trademark of X/Open Group.
sv: UNIX är ett varumärke tillhörande X/Open Group.

source: Linux is a trademark of Linus Torvalds.
sv: Linux är ett varumärke tillhörande Linus Torvalds.

source: X Window System is a trademark of X Consortium, Inc.
sv: X Window System är ett varumärke tillhörande X Consortium, Inc.

source: Windows is a trademark of Microsoft Corp.
sv: Windows är ett varumärke tillhörande Microsoft Corp.

source: Macintosh and Apple are trademarks of Apple Computer, Inc.
sv: Macintosh och Apple är varumärken tillhörande Apple Computer, Inc.

source: All other trademarks are property of their respective owners.
sv: Alla andra varumärken och upphovsrätter refererade till ägs av deras respektive ägare.

source: Dasher is an accessible text entry application that uses pointing gestures rather than typing. It is designed to be fast while fun to use.
sv: Dasher är ett hjälpmedelsprogram för textinmatning som använder pekgester istället för att skriva på tangentbord. Det är designat till att vara snabbt men samtidigt roligt att använda.

source: Introduction
sv: Introduktion

source: <application>Dasher</application> is an information-efficient text-entry interface, driven by natural continuous pointing gestures. Dasher is a competitive text-entry system wherever a full-size keyboard cannot be used - for example on a palmtop or wearable computer, or when operating a computer one-handed (by joystick, touchscreen or mouse) or zero-handed (i.e. by head-mouse or eyetracker). This document describes version 4.2.0 of <application>Dasher</application>.
sv: <application>Dasher</application> är ett informationseffektivt gränssnitt för textinmatning, drivet av naturliga kontinuerliga pekgester. Dasher är ett alternativt textinmatningssystem där ett komplett tangentbord inte kan användas - till exempel på en handdator eller en kroppsnära dator, eller när man hanterar en dator med bara en hand (med styrspak, pekskärm eller mus) eller utan händer (med huvudmus eller ögonspårning). Det här dokumentet beskriver version 4.2.0 av <application>Dasher</application>.

source: <application>Dasher</application> can be started by selecting <guimenuitem>Dasher</guimenuitem> from the <guisubmenu>Accessibility </guisubmenu> submenu of the <guimenu>Main Menu</guimenu>, or by running the command <command>dasher</command> on the command line.
sv: <application>Dasher</application> startas genom att välja <guimenuitem>Dasher</guimenuitem> från undermenyn <guisubmenu>Hjälpmedel </guisubmenu> i <guimenu>Huvudmenyn</guimenu> eller genom att köra kommandot <command>dasher</command> på kommandoraden.

source: What's New
sv: Vad är nytt

source: New features In version 4.2
sv: Nya funktioner i version 4.2

source: There is an automatic speed control, which will speed up Dasher when it senses you are able to go faster.
sv: Det finns en automatisk hastighetskontroll som kommer att snabba upp Dasher när det känner av att du kan skriva snabbare.

source: There is a new socket interface allowing Dasher to listen to head-trackers or gaze-trackers or EEG-interfaces without going through the mouse.
sv: Det finns ett nytt uttagsgränssnitt som gör det möjligt för Dasher att lyssna till huvudspårning, ögonspårning eller EEG-gränssnitt utan att använda musen.

source: There are several `button modes' for people who want to drive Dasher using one, two, three, or four switches.
sv: Det finns flera olika ”knapplägen” för de som vill använda Dasher med en, två, tre eller fyra växlar.

source: There is a `click mode', for people who like to point where they want to go, and click to take a single step in that direction. This is aimed at beginners, in particular
sv: Det finns ett ”klickläge” för människor som gillar att peka dit de vill gå, och klicka för att förflytta sig ett enkelt steg i den riktningen. Detta riktar sig främst till nybörjare

source: What's coming in version 4.4
sv: Vad kommer i version 4.4

source: We will implement a game-mode for Dasher: this will help novices learn to write. A teaching hand will guide the novice when he goes astray, and novices who write fast without needing much guidance will win lots of points.
sv: Vi kommer att implementera ett spelläge för Dasher; det kommer att hjälpa nybörjare att lära sig att skriva. En hjälpande hand kommer att guida novisen när han går vilse, och nybörjare som skriver snabbare utan att behöva hjälp kommer att vinna massor av poäng.

source: New language models will be added, which will make predictions at the word level as well as the letter level.
sv: Nya språkmodeller kommer att läggas till, vilket kommer att skapa förutsägelser på ordnivå såväl som på bokstavsnivå.

source: Japanese and Chinese will be fully supported.
sv: Japanska och kinesiska kommer att stödjas fullt ut.

source: The Dasher team also hopes to create a free web-cam-based head tracker and gaze tracker, `FreeVIM', by December 2006.
sv: Dasher-teamet hoppas kunna skapa en fri webbkamerabaserad huvud- och ögonspårare, ”FreeVIM“ till December 2006.

source: Dasher Basics
sv: Grundläggande i Dasher

source: On a palmtop computer;
sv: På en handdator;

source: on a wearable computer;
sv: på en kroppsnära dator;

source: when operating a computer one-handed, by joystick, touchscreen, trackball, or mouse;
sv: när en dator sköts med endast en hand, med styrspak, pekskärm, styrkula eller mus;

source: when operating a computer with zero hands (i.e., by head-mouse or by eyetracker).
sv: när en dator sköts helt utan händer (t.ex. med huvudmus eller en ögonspårare).

source: Dasher is an information-efficient text-entry interface, driven by natural continuous pointing gestures. Dasher is a competitive text-entry system wherever a full-size keyboard cannot be used - for example, <_:itemizedlist-1/> The eyetracking version of Dasher allows an experienced user to write text as fast as normal handwriting - 29 words per minute; using a mouse, experienced users can write at 39 words per minute.
sv: Dasher är ett informationseffektivt textinmatningsgränssnitt, drivet av naturliga kontinuerliga pekgester. Dasher är ett konkurrenskraftig textinmatningssystem när ett komplett tangentbord inte kan användas - till exempel, <_:itemizedlist-1/> Ögonspårningsversionen av Dasher låter en erfaren användare skriva text lika snabbt som normal handskrift - 29 ord per minut; med en mus kan erfarna användare skriva 39 ord per minut.

source: Dasher can be used to write efficiently in any language.
sv: Dasher kan användas för att skriva effektivt i alla språk.

source: Dasher is fast and fun to learn.
sv: Dasher är snabbt och roligt att lära sig.

source: Dasher is <emphasis>free software</emphasis>. It's distributed under the same license as GNU/Linux, the GPL.
sv: Dasher är <emphasis>fri programvara</emphasis>. Det distribueras under samma licens som GNU/Linux, licensen GPL.

source: How does Dasher work?
sv: Hur fungerar Dasher?

source: Financial Times, 5th February 2002
sv: Financial Times, 5:e februari 2002

source: Dasher is like an arcade game: `Attack of the killer alphabets', perhaps.
sv: Dasher är kanske likt ett arkadspel: ”Attacken från de dödliga alfabeten”.

source: Dasher is a zooming interface. You point where you want to go, and the display zooms in wherever you point. The world into which you are zooming is painted with letters, so that any point you zoom in on corresponds to a piece of text. The more you zoom in, the longer the piece of text you have written. You choose what you write by choosing where to zoom.
sv: Dasher är ett zoomningsgränssnitt. Du pekar dit du vill gå, och displayen zoomar in där du pekar. Världen du pekar in till är målad med bokstäver, så vid vilken punkt som helst du zoomar in på motsvarar det en textdel. Ju mer du zoomar in, desto längre är texten du har skrivit. Du kan välja vad du vill skriva genom att välja var du vill zooma in.

source: To make the interface efficient, we use the predictions of a language model to determine how much of the world is devoted to each piece of text. Probable pieces of text are given more space, so they are quick and easy to select. Improbable pieces of text (for example, text with spelling mistakes) are given less space, so they are harder to write. The language model learns all the time: if you use a novel word once, it is easier to write next time.
sv: För att göra gränssnittet effektivt använder vi förutsägelserna av en språkmodell för att avgöra hur mycket av världen som är avsedd för varje del av text. Sannolika delar av text ges mer utrymme, så att de kan väljas snabbt och enkelt. Mindre sannolik text (exempelvis text med stavfel) ges mindre utrymme så att de blir svårare att skriva. Språkmodellen lär sig hela tiden: om du använder ett ovanligt ord en gång lär den sig det enklare nästa gång.

source: A big advantage of Dasher over other predictive text-entry interfaces that offer word-completions to the user is that it is <emphasis>mode-free</emphasis>: the user does not need to switch from a writing mode to an <quote>accept-model-predictions</quote> mode.
sv: En stor fördel med Dasher framför andra förutsägande textinmatningsgränssnitt som erbjuder ordkomplettering till användaren är att det är <emphasis>lägesfritt</emphasis>: användaren behöver inte byta från skrivläge till ett <quote>acceptera-modell-förutsägelse</quote>-läge.

source: Another advantage is that it is easy to train the model on any writing style: simply load up an example file, then write away!
sv: En annan fördel är att det är enkelt att träna modellen på vilken skrivstil som helst: öppna en exempelfil och skriv bara på!

source: It's quite hard to convey in words what Dasher looks like, so please visit <ulink url="http://www.inference.phy.cam.ac.uk/dasher/" type="http">http://www.inference.phy.cam.ac.uk/dasher/</ulink> to see movies.
sv: Det är ganska svårt att beskriva hur Dasher ser ut med ord, så besök <ulink url="http://www.inference.phy.cam.ac.uk/dasher/" type="http">http://www.inference.phy.cam.ac.uk/dasher/</ulink> för att se filmer.

source: Dasher explained -- the library analogy
sv: Dasher förklarat -- biblioteksliknelsen

source: Imagine <emphasis>a library containing all possible books</emphasis>, ordered alphabetically on a single shelf. Books in which the first letter is <quote>a</quote>; are at the left hand side. Books in which the first letter is <quote>z</quote>; are at the right. In picture (i) below, the shelf is shown vertically with <quote>left</quote>; (a) at the top and ,<quote>right</quote>; (z) at the bottom. The first book in the <quote>a</quote>; section reads <quote><computeroutput>aaaaaaaaaaaa</computeroutput>...</quote>; somewhere to its right are books that start <quote><computeroutput>all good things must come to an end</computeroutput>...</quote>; a tiny bit further to the right are books that start <quote><computeroutput>all good things must come to an enema</computeroutput>...</quote>.
sv: Föreställ dig <emphasis>ett bibliotek som innehåller alla möjliga böcker</emphasis>, sorterade alfabetiskt på en hylla. Böcker i vilken den första bokstaven är <quote>a</quote>; är på vänstra sidan. Böcker i vilken bokstaven <quote>ö</quote> är först är till höger. I bilden (i) nedan är hyllan visad vertikalt med <quote>vänster</quote>; (a) överst och <quote>höger</quote> (ö) nederst. Den första boken i <quote>a</quote>-sektionen börjar med <quote><computeroutput>aaaaaaaaaaaa</computeroutput>...</quote>; någonstans till höger finns böcker som börjar med <quote><computeroutput>alla bra böcker slutar</computeroutput>...</quote>; lite mer till höger finns böcker som börjar med <quote><computeroutput>alla bra böcker slutspel</computeroutput>...</quote>.

source: When someone writes a piece of text, their choice of the text string can be viewed as a choice of a book from this library of all books - the book that contains exactly the chosen text. How do they choose that book? Let's imagine they want to write <quote><computeroutput>all good things</computeroutput>...</quote>;
sv: När någon skriver en text kan deras textsträngval ses som ett val av böcker från detta bibliotek för alla böcker - boken som innehåller precis den valda texten. Hur väljer de den boken? Låt oss föreställa oss att de vill skriva <quote><computeroutput>alla bra böcker</computeroutput>...</quote>;

source: The library of all books.
sv: Alla böckers bibliotek.

source: First, they walk into the <quote> <computeroutput>a</computeroutput> </quote>; section of the library. There, they are confronted by books starting <quote> <computeroutput>aa</computeroutput> </quote>;, <quote> <computeroutput>ab</computeroutput> </quote>, <quote><computeroutput>ac</computeroutput>...</quote>; <quote> <computeroutput>az</computeroutput> </quote>; [Picture (ii)]. Looking more closely at the <quote> <computeroutput>al</computeroutput> </quote>; section, they can find books starting <quote> <computeroutput>ala</computeroutput> </quote>;, <quote>;<computeroutput>alb</computeroutput></quote>;,...; <quote> <computeroutput>alz</computeroutput> </quote>; [Picture (iii)].
sv: Först går de in i bibliotekets avsnitt <quote> <computeroutput>a</computeroutput> </quote>. Där finner de böcker som börjar med <quote> <computeroutput>aa</computeroutput> </quote>;, <quote> <computeroutput>ab</computeroutput> </quote>, <quote> <computeroutput>ac</computeroutput>...</quote>; <quote> <computeroutput>aö</computeroutput> </quote>; [Bild (ii)]. Vid närmare titt på avsnittet <quote> <computeroutput>al</computeroutput> </quote> finner de böcker som börjar med <quote> <computeroutput>ala</computeroutput> </quote>;, <quote>;<computeroutput>alb</computeroutput></quote>;,...; <quote> <computeroutput>alö</computeroutput> </quote>; [Bild (iii)].

source: By looking ever more closely at the shelf, the writer can find the book containing the text he wishes to write. Thus writing can be described as <emphasis>zooming in on an alphabetical library, steering as you go</emphasis>.
sv: Genom att titta ännu närmare på bokhyllan kan författaren hitta boken med texten han önskar att skriva. Därav kan skrivning beskrivas som att <emphasis>zooma in på ett alfabetiskt bibliotek, där styrningen sker allteftersom du färdas</emphasis>.

source: This is exactly how Dasher works, except for one crucial point: <emphasis>we alter the SIZE of the shelf space devoted to each book in proportion to the probability of the corresponding text.</emphasis> For example, not very many books start with an <quote> <computeroutput>x</computeroutput> </quote>;, so we devote less space to <quote><computeroutput>x</computeroutput>...;</quote>; books, and more to the more plausible books, thus making it easier to find books that contain probable text.
sv: Det är precis så Dasher fungerar, förutom en viktig punkt: <emphasis>vi ändrar STORLEKEN för hyllutrymmet avsett för varje bok i proportion mot sannolikheten av motsvarande text.</emphasis> Till exempel börjar inte många böcker med <quote> <computeroutput>x</computeroutput> </quote>;, Så vi lämnar mindre utrymme för böcker på <quote><computeroutput>x</computeroutput>...;</quote> och fler till aktuellare böcker, vilket gör det enklare att hitta böcker som innehåller sannolik text.

source: Here is the corresponding sequence of pictures of the library in Dasher. (The character <quote>_</quote>; denotes the space character.)
sv: Här är motsvarande bildsekvens i Dashers bibliotek. (Tecknet <quote>_</quote> motsvarar blankstegstecknet.)

source: Dasher can be trained on examples of any writing style, and it learns all the time, picking up your personal turns of phrase.
sv: Dasher kan tränas på vilken skrivstil som helst och lär sig hela tiden, samt plockar upp din personliga frasstil.

source: The image below shows the state of the Dasher interface while the user is writing the word `objection'; alternative words that could easily be written at this point include `objective', `objects_', and `object_oriented'.
sv: Bilden nedan visar tillståndet för Dashers gränssnitt medan användaren skriver ordet ”objection”; alternativa ord som enkelt skulle kunna skrivas vid denna punkt omfattar `objective', `objects_', och `object_oriented'.

source: Writing `objection' in Dasher.
sv: Skriva ”objection” i Dasher.

source: If you find Dasher hard to imagine based on these static pictures, please take a look at the movies on <ulink url="http://www.inference.phy.cam.ac.uk/dasher/" type="http">http://www.inference.phy.cam.ac.uk/dasher/</ulink>.
sv: Om du tycker att Dasher är svårt att föreställa sig baserat på dessa statiska bilder, ta en titt på filmerna på <ulink url="http://www.inference.phy.cam.ac.uk/dasher/" type="http">http://www.inference.phy.cam.ac.uk/dasher/</ulink>.

source: Tips for novices
sv: Tips för nybörjare

source: Don't give up if it takes you a minute or two to get started - within ten minutes, you'll be blazing along. It's a lot like driving a car. You should <emphasis>start by driving cautiously</emphasis>. If you can't tell where you are going, <emphasis>stop going</emphasis>. Indeed, you will probably learn Dasher fastest if you come to it with car-driving analogies in mind, rather than standard computer analogies. For example, the way navigation works is not by DRAGGING but by STEERING: if cars worked like windows computers, you would have to <quote>grab</quote> the piece of road you want, then ,<quote>drag</quote>; it towards you; but in a car, when you wish to drive right, you POINT RIGHT with your steering wheel. Dasher does not work by dragging either. <emphasis>Do not try to grab things and drag them. Just decide where you want to go, and point there.</emphasis>
sv: Ge inte upp om det tar några minuter att komma igång - inom tio minuter kommer det att gå snabbt. Det är som att köra en bil. Du bör <emphasis>börja med att köra försiktigt</emphasis>. Om du inte kan avgöra vart du ska, <emphasis>sluta kör</emphasis>. Du kommer förmodligen lära dig Dasher snabbast om du kommer till det med bilförarliknelser i åtanke istället för vanliga datoranvändarliknelser. Exempelvis fungerar navigeringen inte genom att DRA men genom att STYRA: om bilar fungerade som Windows-datorer skulle du behöva <quote>ta tag i</quote> vägdelen du ville ha, och sedan <quote>dra</quote> den mot dig; men när du vill köra åt höger i en bil PEKAR DU HÖGER med din ratt. Dasher behöver inte arbeta genom att dra heller. <emphasis>Försök att inte ta saker och dra dem. Försök att avgöra vart du vill gå och peka där.</emphasis>

source: <emphasis>The single most important concept</emphasis> that a novice user needs to understand is that one should always continue <emphasis>inside</emphasis> the text written so far: to select the book that contains <quote>all</quote>; as its first word, one does <emphasis>not</emphasis> enter the <quote>a</quote>; section of the library, then exit the <quote>;a</quote>; section, and enter the ,<quote>l</quote>; section. One enters the <quote>a</quote>; section, then finds the <quote>al</quote>; section that is <emphasis>within</emphasis> the <quote>a</quote>; section, then enters the <quote>all</quote>; section <emphasis>within</emphasis> the <quote>al</quote>; section.
sv: <emphasis>Det i särklass viktigaste konceptet</emphasis> som en nybörjaranvändare behöver förstå är att man alltid ska fortsätta <emphasis>inåt</emphasis> i texten skriven hittills: väljer man boken som innehåller <quote>alla</quote> som sitt första ord, går man <emphasis>inte</emphasis> in i <quote>a</quote>-avsnittet i biblioteket och sedan ut ur <quote>a</quote>-avsnittet och in i <quote>l</quote>-avsnittet. Man går in i avsnittet <quote>a</quote>; hittar sedan <quote>al</quote> som är <emphasis>inom</emphasis> avsnittet <quote>a</quote>; sedan in i avsnittet <quote>alla</quote> <emphasis>inom</emphasis> avsnitt <quote>all</quote> som i sin tur finns <emphasis>inom</emphasis> avsnittet <quote>al</quote>.

source: It's just like finding a name in a phonebook. To find <quote> <computeroutput>Alison</computeroutput> </quote>;, you don't go to the <quote> <computeroutput>A</computeroutput> </quote>; section of the phonebook, then the <quote>;<computeroutput>L</computeroutput></quote>; section: you go into the <quote> <computeroutput>A</computeroutput> </quote>; section, then find <emphasis>within it</emphasis> the <quote> <computeroutput>Al</computeroutput> </quote>; section, and so forth. Once you are in the <quote> <computeroutput>Al</computeroutput> </quote>; section, you never leave it.
sv: Det är precis som att hitta ett namn i en telefonbok. För att hitta <quote> <computeroutput>Alison</computeroutput> </quote> går du inte till avsnitt <quote> <computeroutput>A</computeroutput> </quote> och sedan till avsnitt <quote>;<computeroutput>L</computeroutput></quote> i telefonboken: du går till avsnitt <quote><computeroutput>A</computeroutput></quote> och hittar sedan <emphasis>inom det</emphasis> avsnittet <quote> <computeroutput>Al</computeroutput> </quote> och så vidare. När du väl är inom avsnittet <quote> <computeroutput>Al</computeroutput> </quote> lämnar du det aldrig.

source: <emphasis>The second most important idea</emphasis> is that what you have written depends <emphasis>only</emphasis> on where you finally end up in the library, not on how you got there; so there is no need to steer accurately on your way to your destination. <emphasis>You are allowed to cut corners.</emphasis> (For example, in the previous image, if you wanted to write `objects_are', it would be fine to move the mouse straight towards the letters `are', even if this takes the mouse across the unwanted grey `i' square.)
sv: <emphasis>Den näst viktigaste idén </emphasis> är att vad du har skrivit <emphasis>endast</emphasis> beror på var du slutligen hamnar i biblioteket, inte på hur du kom dit; så det finns inget behov av att styra rätt på vägen till din destination. <emphasis>Du tillåts ta genvägar.</emphasis> (Exempelvis i föregående bild, om du ville skriva ”objects_are” skulle det vara ok att flytta musen rakt till bokstäverna ”are”, även om detta tar musen över den oönskade gråa ”i”-rutan.)
