Repository: GNOME/dasher
Catalog: Data/Help/Gnome/*/*.po
Languages: sv

source: <emphasis>Common errors.</emphasis> Often, a beginner who is trying to find a particular letter will drive the display forwards fast while hunting for the letter. The rule of the road for Dasher users is just like that for car-drivers: don't drive forwards until you have identified where you want to go! So, after you have found the first letter of your sentence, and zoomed towards it, please <emphasis>SLOW DOWN and don't proceed any further into this first letter's square until you have figured out where you should be steering towards</emphasis>. Your next letter <emphasis>is</emphasis> there, immediately inside the first square you have entered. The letters are ordered alphabetically. If you can't see your letter, figure out where it must be on the basis of the letters you <emphasis>can</emphasis> see. Then point to the right place and enter the second letter's square.
sv: <emphasis>Vanliga fel.</emphasis> Ofta kommer en nybörjare som försöker att hitta en speciell bokstav att köra framåt snabbt efter jakt på bokstaven. Regeln för vägen för Dashers användare är precis som för bilförare: kör inte framåt innan du har identifierat var du vill åka! Så, efter att du har funnit den första bokstaven i din mening och zoomat mot den, <emphasis>SAKTA NED och fortsätt inte in i denna bokstavs första ruta innan du har listat ut vad du ska styra mot</emphasis>. Din nästa bokstav <emphasis>är</emphasis> där, omedelbart i den första rutan du har gått in i. Bokstäverna är sorterade alfabetiskt. Om du inte kan se din bokstav, klura ut var den kan finnas baserat på bokstäverna du <emphasis>kan</emphasis> se. Peka sedan mot rätt plats och gå in i den andra bokstavens ruta.

source: Example
sv: Exempel

source: Writing <quote> <computeroutput>I once had a whim</computeroutput> </quote>;. Where should the user steer now?
sv: Skriver <quote> <computeroutput>I once had a whim</computeroutput> </quote>; Vart ska användaren styra nu?

source: Imagine you want to write `<computeroutput>I once had a whim</computeroutput>'. You write `<computeroutput>I once ha...</computeroutput>' and the Dasher display looks like <xref linkend="figHad1"/>. You want to write `<computeroutput>had</computeroutput>'. What should you do? There are lots of letter <computeroutput>d</computeroutput>s on the screen, and all of them are rather small. The five arrows in <xref linkend="figHad1"/> show some of these <computeroutput>d</computeroutput>s. The purple arrow points to a <computeroutput>d</computeroutput> that we can't see yet, but we know it must be there because we can see `<computeroutput>a</computeroutput>', `<computeroutput>b</computeroutput>', and `<computeroutput>c</computeroutput>' above it.
sv: Föreställ dig att du vill skriva ”<computeroutput>I once had a whim</computeroutput>“. Du skriver “<computeroutput>I once ha...</computeroutput>“ och Dashers yta ser ut som <xref linkend="figHad1"/>. Du vill skriva”<computeroutput>had</computeroutput>”. Vad ska du göra? Det finns massor av <computeroutput>d</computeroutput>-bokstäver och alla är de ganska små. De fem pilarna i <xref linkend="figHad1"/> visar några av dessa<computeroutput>d</computeroutput>:n. Den lila pilen pekar på ett <computeroutput>d</computeroutput> som vi inte kan se ännu, men vi vet att det måste vara där eftersom vi kan se ”<computeroutput>a</computeroutput>”, ”<computeroutput>b</computeroutput>” och ”<computeroutput>c</computeroutput>”.

source: Some alternative letter <computeroutput>d</computeroutput>s, with a beginner's error highlighted
sv: Några alternativa bokstäver <computeroutput>d</computeroutput> med en nybörjares fel markerade

source: A common beginner's mistake is to keep rushing forward and spot <emphasis>any</emphasis> of these letter <computeroutput>d</computeroutput>s, and zoom into it. For example, <xref linkend="figHad3"/> shows what happens if the user zooms towards the <computeroutput>d</computeroutput> highlighted in <xref linkend="figHad2"/>.
sv: Ett vanligt nybörjarfel är att fortsätta framåt och inte markera <emphasis>några</emphasis> av dessa bokstäver <computeroutput>d</computeroutput> och zooma in i dem. Exempelvis visar <xref linkend="figHad3"/> vad som händer om användaren zoomar mot <computeroutput>d</computeroutput> markerat i <xref linkend="figHad2"/>.

source: What happens when you select the wrong <computeroutput>d</computeroutput>
sv: Vad händer när du väljer fel <computeroutput>d</computeroutput>

source: If you go in this <computeroutput>d</computeroutput>, you are writing `<computeroutput>I once </computeroutput><emphasis>head</emphasis><computeroutput>...</computeroutput>'. The other two <computeroutput>d</computeroutput>s labelled by red arrows (in <xref linkend="figHad1"/>) correspond to writing `<computeroutput>I once </computeroutput><emphasis>heard</emphasis><computeroutput>...</computeroutput>' and `<computeroutput>I once </computeroutput><emphasis>hedge</emphasis><computeroutput>...</computeroutput>'.
sv: Om du går in i <computeroutput>d</computeroutput> skriver du ”<computeroutput>I once </computeroutput><emphasis>head</emphasis><computeroutput>...</computeroutput>”. De andra två <computeroutput>d</computeroutput>:na markerade av röda pilar (i <xref linkend="figHad1"/>) motsvarar att skriva ”<computeroutput>I once </computeroutput><emphasis>heard</emphasis><computeroutput>...</computeroutput>” och ”<computeroutput>I once </computeroutput><emphasis>hedge</emphasis><computeroutput>...</computeroutput>”.

source: It is crucial to understand that there is only one correct <computeroutput>d</computeroutput>, namely the <computeroutput>d</computeroutput> that is immediately inside the blue box corresponding to letter `<computeroutput>a</computeroutput>' in the sequence `<computeroutput>I once ha</computeroutput>'. That blue box is highlighted in <xref linkend="figHad4"/>.
sv: Det viktigt att förstå att det endast finns ett enda korrekt <computeroutput>d</computeroutput>, nämligen <computeroutput>d</computeroutput> som är omedelbart inuti den blåa rutan motsvarande bokstaven ”<computeroutput>a</computeroutput>' i sekvensen `<computeroutput>I once ha</computeroutput>”. Den blåa rutan är markerad i <xref linkend="figHad4"/>.

source: The correct letter <computeroutput>d</computeroutput> is the one marked by the green arrow. This example illustrates the rule <quote>always keep going <emphasis>inside</emphasis> the box that you want</quote>; in this case, the blue box associated with the letter <computeroutput>a</computeroutput> of the word <quote> <computeroutput>had</computeroutput> </quote>;
sv: Den korrekta bokstaven <computeroutput>d</computeroutput> är den som är markerad av den gröna pilen. Detta exempel illustrerar regeln att <quote>alltid fortsätta <emphasis>inuti</emphasis> rutan du vill till, </quote>; i detta fall, den blå rutan associerad med bokstaven <computeroutput>a</computeroutput> för ordet <quote> <computeroutput>had</computeroutput> </quote>;

source: If you ever leave that blue box (as we did in <xref linkend="figHad3"/>) then we lose the letter `<computeroutput>a</computeroutput>'.
sv: Om du någonsin lämnar den blå rutan (som vi gjorde i <xref linkend="figHad3"/>) så förlorar vi bokstaven ”<computeroutput>a</computeroutput>”.

source: Summary
sv: Sammanfattning

source: <emphasis>Don't click. Don't drag. And don't speed.</emphasis>
sv: <emphasis>Klicka inte. Dra inte. Stressa inte.</emphasis>

source: What do the colours mean?
sv: Vad betyder färgerna?

source: <emphasis>white</emphasis> squares contain the space characters (always placed at the bottom of the alphabet);
sv: <emphasis>vita</emphasis> fyrkanter innehåller blankstegstecken (alltid placerade längst ned i alfabetet);

source: a special <emphasis>yellow</emphasis> box contains the upper case characters [A-Z];
sv: en speciell <emphasis>gul</emphasis> ruta innehåller stora bokstäver [A-Ö];

source: a <emphasis>red</emphasis> box contains numerals [0-9] (if the full alphabet is enabled);
sv: en <emphasis>röd</emphasis> ruta innehåller siffror [0-9] (om hela alfabetet är aktiverat);

source: a <emphasis>green</emphasis> box contains punctuation characters (with the characters most similar to the space character [.,;:-] placed at the bottom, next to the <emphasis>white</emphasis> space character. Within the punctuation section, letters with similar roles are coloured similarly: punctuation characters similar to the period [.,;:-] are coloured slate-blue;
sv: en <emphasis>grön</emphasis> ruta innehåller skiljetecken (tecknen mest lika blankstegstecknet [.,;:-] placerade längst ned, intill det <emphasis>vita</emphasis> blankstegstecknet. Inom avsnittet för skiljetecknen, färgas bokstäver med liknande roller med liknande färger: skiljetecken liknande [.,;:-] färgas skifferblåa;

source: the other colours are included simply to discriminate the squares from each other.
sv: de andra färgerna inkluderas endast för att du ska kunna urskilja fyrkanterna från varandra.

source: In languages with accents (grave, acute, circumflex, etc), the accents are displayed in an <emphasis>orange</emphasis> box.
sv: I språk med accenter (en grav accent, en akut accent, cirkumflex med mera) visas accenterna i en <emphasis>orange</emphasis> ruta.

source: In the Japanese version of Dasher, colours are used to distinguish the different hiragana groups (eg ka,ki,ku,ke,ko are orange).
sv: I den japanska versionen av Dasher används färger för att skilja på de olika hiragana-grupperna (exempelvis är ka, ki, ku, ke, ko orange).

source: In the Korean version of Dasher, three different colours are used to distinguish initial consonants, vowels, and terminal consonants.
sv: I den koreanska versionen av Dasher används tre olika färger för att skilja ut initiala konsonanter, vokaler och slutkonsonanter.

source: In the English-language desktop version 3 of Dasher, <_:itemizedlist-1/>
sv: I den engelskspråkiga skrivbordsversion 3 av Dasher, <_:itemizedlist-1/>

source: You can alter the colour scheme by editing the <computeroutput>colour</computeroutput> and <computeroutput>alphabet</computeroutput> xml files, as described in <xref linkend="personalising"/>.
sv: Du kan ändra färgschemat genom att redigera xml-filerna för <computeroutput>färg</computeroutput> och <computeroutput>alfabetet</computeroutput> som beskrivet i <xref linkend="personalising"/>.

source: How to start dasher (version 4)
sv: Hur man startar dasher (version 4)

source: Set the dasher application running; when the dasher window comes up, either click the left mouse button or press the space bar to set it going. [One of these two will work.] Repeat this action (click or space), when you are finished, to stop dasher from dashing. Your computer's mouse controls Dasher.
sv: Ange körande Dasher-program; när Dasher-fönstret visas, klicka på vänster musknapp eller tryck ned mellanslag för att starta det. [En av dessa två kommer att fungera.] Upprepa denna åtgärd (klicka eller trycka ned mellanslag) när du är klar för att stoppa Dasher. Din dators mus kontrollerar Dasher.

source: Adjust the speed slider to fix the maximum speed Dasher will zoom at. A speed of 1 is good for a beginner, increasing to 2 after 5 minutes' practice, and to 4 when you are expert.
sv: Justera skjutreglaget för hastighet för att sätta Dashers högsta zoomhastighet. En hastighet på 1 är bra för en nybörjare, öka till 2 efter fem minuters övning och till 4 när du är expert.

source: How to start dasher (version 2) on pocket PC
sv: Hur man startar dasher (version 2) på Pocket PC

source: Install, run (wait a few seconds for it to load up the training file), then touch the screen with the stylus to make dasher move.
sv: Installera, kör (vänta några få sekunder för att öppna träningsfilen), rör sedan skärmen med styluspennan för att få Dasher att röra sig.

source: There are three special strongly-coloured squares in this version of Dasher, coloured yellow, red (in some releases only), and green; all three squares do not produce any character; these squares indicate sub-groupings of the alphabet. (Uppercase Alphabet, Numerals (in some releases only), and Punctuation.)
sv: Det finns tre speciella starkt färgade rutor i denna version av Dasher, färgade gult, rött (endast i några utgåvor) och grönt; alla tre rutor producerar inte tecken; dessa rutor indikerar undergrupper av alfabetet. (Versaler, siffror (endast i några utgåvor) och skiljetecken.)

source: How to use Dasher in real life
sv: Hur man använder Dasher i verkliga livet

source: Dasher can be used to communicate through your computer, and (to some degree) to control your computer. Obviously, the simplest way to communicate with Dasher is to have the person you're talking to watch the screen as you write. But there are lots of other ways to communicate through Dasher.
sv: Dasher kan användas för att kommunicera genom din dator och (till en viss gräns) för att kontrollera din dator. Uppenbart så är det enklaste sättet att kommunicera med Dasher att ha personen du pratar med se skärmen allteftersom du skriver. Men det finns många olika sätt att kommunicera genom Dasher.

source: Copy to clipboard
sv: Kopiera till urklipp

source: If you have the `copy on stop' feature switched on, then, every time you stop Dasher, the contents of Dasher's text box get copied directly to your computer's clipboard. You can then use the `Paste' function of another application to transfer what you've written.
sv: Om du har funktionen ”kopiera vid stopp” påslagen, kommer Dasher varje gång det stoppas att kopiera innehållet i Dashers textruta direkt till din dators urklipp. Du kan använda funktionen ”Klistra in” i ett annat program för att överföra vad du skrivit.

source: Speaking
sv: Tal

source: Dasher connects to your computer's built-in text-to-speech system. There are several ways to use Dasher for speaking.
sv: Dasher ansluter till din dators inbyggda text-till-tal-system. Det finns flera sätt för Dasher att tala på.

source: You can choose to have Dasher `speak each word': every time you pass through the end of a word (by entering a space character for example), that word gets spoken immediately.
sv: Du kan välja att få Dasher att ”säga varje ord”: varje gång du passerar genom slutet av ett ord (genom att ange exempelvis ett blanksteg), sägs det ordet direkt.

source: You can also choose to have Dasher `speak on stop': every time you stop Dasher moving, everything that is in the text box gets spoken.
sv: Du kan också välja att låta Dasher ”läs upp vid stopp”: var gång du stoppar Dasher från rörelse blir allt som är i textrutan sagt.

source: Finally, you can speak exactly when you want to by switching on <emphasis>Control Mode</emphasis> (which is under the Options Menu in Dasher version 3). This mode brings up an extra box in the Dasher alphabet, coloured grey, which works a bit like an escape key on a keyboard. If you go inside the Control box, you will find several control-related options: Stop (red); pause (yellow); Move; Delete; and Speak. Inside the Speak box are the options to `speak everything', `speak new' (just the new words that you wrote since the last utterance), and `speak again' (which re-speaks whatever was last spoken).
sv: Slutligen kan du säga vad du vill när du vill genom att slå på <emphasis>Styrningsläge</emphasis> (som finns under menyn Alternativ i Dasher version 3). Detta läge tar fram en extra ruta i Dashers alfabet, färgad grå, som fungerar litegrann som escape-tangenten på ett tangentbord. Om du går in i Styrningsrutan kommer du att hitta flera styrningsrelaterade alternativ: Stoppa (röd); pausa (gul); Flytta; Ta bort; och Läs upp. Inuti Läs upp-rutan finns alternativen att ”läs upp allt”, ”läs upp nytt” (endast de nya ord som du skrev sedan sista yttrandet) och ”läs upp igen” (som säger vad som senast sades).

source: Save to file
sv: Spara till fil

source: You can save whatever is in the text box of Dasher as a plain text file by clicking the `Save file' icon in the icon bar, or using the menus at the top of the Dasher window (selecting File then Save).
sv: Du kan spara vadsomhelst i Dashers textruta som en textfil genom att klicka på ikonen ”Spara fil” på ikonraden, eller använda menyerna överst i Dasherfönstret (välj Arkiv och sedan Spara).

source: Send text to other window
sv: Skicka text till andra fönster

source: You can also have whatever is written in Dasher be directly beamed to another window. Enable the `send text to other window' option under the options menu. Then the window that you select will get Dasher's output.
sv: Du kan alltså få vadsomhelst som är skrivet i Dasher att direkt kopieras till ett annat fönster. Aktivera egenskapen ”skicka text till ett annat fönster” under menyn alternativ. Sedan kommer fönstret du väljer att få Dashers utdata.

source: Font sizes
sv: Typsnittsstorlekar

source: Dasher has a text box (where the text appears) and a Dasher canvas (where all the fun zooming action happens). You can change the font sizes of both these regions using the Dasher menus at the top of the Dasher window. The two fonts are called the `Edit font' (for the text box's font), and the `Dasher font', I think. (I forget the exact menu names in Dasher version 3, sorry.) To change the edit font size bring up the usual dialog box and change size. To change the Dasher canvas size, find the Dasher-size option, which offers three to choose from, named something like: small, medium, and large.
sv: Dasher har en textruta (där texten visas) och en Dasherrityta (där all rolig zoom händer). Du kan ändra typsnittsstorlekar för båda dessa områden genom att använda Dasher-menyerna överst i Dasher-fönstret. De två typsnitten kallas ”Redigeringstypsnitt” (för textrutans typsnitt) och ”Dasher-typsnitt” tror jag. (Jag har glömt de precisa menynamnen i Dasher version 3, ursäkta.) För att ändra redigeringstypsnitt, ta fram den vanliga användardialogen och ändra storlek. För att ändra Dashers storlek på rityta, hitta alternativet för Dashers storlek som erbjuder tre att välja på, med namn i stil med: small, medium och large.

source: Personalizing Dasher
sv: Personalisera Dasher

source: There are three classes of files you can tweak in order to make Dasher work better for you: <computeroutput>alphabet</computeroutput> files, <computeroutput>colour</computeroutput> files, and <computeroutput>training</computeroutput> files.
sv: Det finns tre klasser av filer du kan förfina för att få Dasher att fungera bättre för dig: <computeroutput>alfabet</computeroutput>filer, <computeroutput>färg</computeroutput>filer och <computeroutput>tränings</computeroutput>filer.

source: Personalizing the language model
sv: Personalisera språkmodellen

source: Dasher's predictions (in version 3 of Dasher) are based not on a dictionary but on a training text of ordinary text. For example, when you download Dasher version 3, it comes with a file called <filename>training_english_GB.txt</filename>. This is 300 kbytes of ordinary English harvested from various documents on the Internet.
sv: Dashers förutsägelser (i version 3 av Dasher) baseras inte på ett uppslagsverk utan på en träningstext av vanlig text. Exempelvis, när du hämtar hem Dasher version 3 medföljer en fil kallad <filename>training_english_GB.txt</filename>. Detta är 300 kbyte av engelska, inhämtad från olika dokument på internet.

source: If possible, provide Dasher with a training text in your own style -- a plain text file made from documents you have written before, and containing your own pet phrases, friends' names, and so forth. Either append this file to the training file, or replace the original training file.
sv: Om möjligt, ge Dasher en träningstext i din egen stil -- en vanlig text gjord från dokument du har skrivit förut och innehållandes dina egna djurnamn, vänners namn och så vidare. Lägg till eller ersätt den ursprungliga filen.

source: If you think your personal training file may have become corrupted with rubbish text, edit it using any plain text editor. (Or ask a friend to do this for you.)
sv: Om du tänker att din personliga träningsfil kan ha blivit korrupt med skräptext, redigera den med en vanlig textredigerare. (Eller be din vän göra detta för dig.)

source: If you use Dasher for many months, the personal training file may become so large that Dasher becomes slow to start up; if so, edit the training file using a plain text editor.
sv: Om du använder Dasher i flera månader kommer de personliga träningsfilerna att bli så stora att Dasher startar långsamt; i så fall, redigera träningsfilen med en vanlig textredigerare.

source: When you use Dasher, it stores everything you write in another personal file with the same name as the training file. Next time you use Dasher, it reads in the original training file and everything you wrote last time, to help it predict better. Dasher learns all the time. To get the best results from Dasher: <_:itemizedlist-1/>
sv: När du använder Dasher lagrar det allt du skriver i en annan personlig fil med samma namn som träningsfilen. Nästa gång du använder Dasher läser det in den ursprungliga träningsfilen och allt du skrivit senast, för att ge bättre förutsägelser. Dasher lär sig hela tiden. För att få bästa resultat från Dasher: <_:itemizedlist-1/>

source: Personalizing the alphabet
sv: Personalisera alfabetet

source: Which characters are available to you, and their order, is determined by the alphabet file. For example, you might use <filename>alphabet.english.xml</filename>. Dasher comes with many alternative alphabets. You can edit alphabet files to change which characters are in the alphabet, or their order. When you edit this xml file, it might be a good idea to save the new file with a new name and change the name of the alphabets in the new file, to avoid confusion. Each field in the xml file specifies a symbol by three items: the character that should be <emphasis>displayed</emphasis> (<computeroutput>d=</computeroutput>...); the character that goes into the <emphasis>text</emphasis> when this symbol is selected (<computeroutput>t=</computeroutput>...); and the background colour number of the box for this symbol (<computeroutput>b=</computeroutput>...), of which more below.
sv: Vilka tecken som är tillgängliga för dig, och deras ordning, avgörs av alfabetsfilen. Exempelvis kan du använda <filename>alphabet.english.xml</filename>. Dasher kommer med många alternativa alfabet. Du kan redigera alfabetsfiler för att ändra vilka tecken som finns i det, eller deras ordning. När du redigerar denna xml-fil kan det vara en god ide att spara den nya filen med ett nytt namn och ändra namnet på alfabeten i denna fil, för att undvika förvirring. Varje fält i xmlfilen avgörs av en symbol med tre objekt: tecknet som ska <emphasis>visas</emphasis> (<computeroutput>d=</computeroutput>...); tecknet som visas i <emphasis>text</emphasis> när denna symbol är markerad (<computeroutput>t=</computeroutput>...); och bakgrundsfärgens siffra för rutan för denna symbol (<computeroutput>b=</computeroutput>...), som det finns mer av nedan.

source: Personalizing the colour scheme
sv: Personalisera färgschemat

source: You can change the colours of the Dasher world in two ways. The colour file (for example <filename>colour.xml</filename> or <filename>colour.euroasian.xml</filename>) specifies the 200 colours in the palette that Dasher uses. Each line specifies red, green, blue values.
sv: Du kan ändra färgerna i Dashers värld på två sätt. Färgfilen (exempelvis <filename>colour.xml</filename> eller <filename>colour.euroasian.xml</filename>) specificerar de 200 färgerna i paletten Dasher kan använda. Varje rad specificerar röda, gröna och blåa värden.
