Repository: GNOME/dasher
Catalog: Data/Help/Gnome/*/*.po
Languages: sv

source: These colours are used to colour multiple objects in dasher. If for example you want to change the colour of the <quote>red line</quote>;, change the second colour line of the colour file, which reads <computeroutput>&lt;colour r="255" g="0" b="0"/&gt;</computeroutput>.
sv: Dessa färger används för att färglägga flera objekt i Dasher. Om du till exempel vill ändra färgen för den <quote>röda raden</quote>;, ändra den andra färgraden i färgfilen, som innehåller <computeroutput>&lt;colour r="255" g="0" b="0"/&gt;</computeroutput>.

source: You can change which of these colours is used for each symbol's box by changing the <quote>b</quote>; field for that symbol in the alphabet file.
sv: Du kan ändra vilken av dessa färger som används för varje symbols ruta genom att ändra fältet <quote>b</quote> för varje symbol i alfabetsfilen.

source: Languages
sv: Språk

source: Dasher works in hundreds of languages.
sv: Dasher fungerar på hundratals olika språk.

source: For each language there is an alphabet file (or possibly more than one alphabet file). On the Dasher website we aim to supply at least one training text for each language. If we don't have a good training text for your language, please help us by making one and sending it to us.
sv: För varje språk finns det en alfabetsfil (eller möjligen mer än en alfabetsfil). På Dashers webbplats strävar vi efter att tillhandahålla minst en träningsfil för varje språk. Om vi inte har en bra träningstext för ditt språk, hjälp oss genom att skapa en och sända den till oss.

source: See the Dasher website for the list of languages supported by Dasher. As of October 2005, all the major languages of the world are well supported, with the exception of Japanese and Chinese, for which Dasher version 3 offers only phonetic support (hiragana and pin-yin). In Dasher version 4, we will provide full support for Japanese and Chinese.
sv: Se Dashers webbplats för en lista över vilka språk som stöds av Dasher. I oktober 2005 stöddes alla större språk i världen väl, med undantag av japanska och kinesiska, för vilka Dasher version 3 har fonetiskt stöd (hiragana och pin-yin). I Dasher version 4 kommer vi stöda japanska och kinesiska fullt ut.

source: Dasher Special Needs Guide
sv: Dashers guide för speciella behov

source: Dasher is designed on the principle of getting <emphasis>as much information as possible</emphasis> from the gestures you can make.
sv: Dasher är designat på principen om att ta fram <emphasis>så mycket information som möjligt</emphasis> från de gester du kan göra.

source: <emphasis>Continuous</emphasis> gestures (conveyed via a joystick, trackpad, head mouse, or gaze tracker, for example) often achieve the highest rates of writing.
sv: <emphasis>Kontinuerliga</emphasis> gester (med en styrspak, styrplatta, huvudmus eller ögonspårning) når oftast de högre nivåerna av skrivning.

source: <emphasis>Discrete</emphasis> gestures (switches, button presses) may be able to convey information in three different ways:
sv: <emphasis>Diskreta</emphasis> gester (växlar, knapptryckningar) kan förmedla information på tre olika sätt:

source: The <emphasis>time</emphasis> at which you press a button can convey information. (This idea is used in grid systems controlled by a single button.)
sv: <emphasis>Tiden</emphasis> för när du tryckte på en knapp kan förmedla information. (Idén används i rutnätssystem kontrollerade av en enskild knapp.)

source: <emphasis>How long</emphasis> you press a button for can convey information. (This idea is used in Morse code, where two durations are distinguished.)
sv: <emphasis>Hur länge</emphasis> du trycker ned en knapp kan avslöja information. (Denna idé används i Morse-kod där längden är utmärkande.)

source: The <emphasis>choice</emphasis> of <emphasis>which</emphasis> button you press can convey information. (This idea is used in ordinary keyboards.)
sv: <emphasis>Valet</emphasis> av <emphasis>vilken</emphasis> knapp du kan trycka ned kan förmedla information. (Denna idé används i vanliga tangentbord.)

source: We can get information from whichever of the following is easiest for you: <_:orderedlist-1/>
sv: Vi kan få information från vilkendera av följande som är lättast för dig: <_:orderedlist-1/>

source: Continuous gestures
sv: Kontinuerliga gester

source: Dasher's normal mode (<emphasis>mouse mode</emphasis>) is driven by a two-dimensional continuous steering gesture. Dasher also has a <emphasis>one-dimensional mode</emphasis>, for users who can control only one dimension.
sv: Dashers normala läge (<emphasis>musläge</emphasis>) drivs av tvådimensionella kontinuerliga styrgester. Dasher har också ett <emphasis>endimensionellt läge</emphasis> för användare som endast kan kontrollera en dimension.

source: Can you make one or two continuous gestures? If you can operate a joystick, mouse, trackpad, or rollerball, then you have a two-dimensional control. If you can point on a touch-screen then that's perfect too. Can you move your nose around? If you can shake your head, that's a one-dimensional control; if you can nod, that's two. A head-mouse can be quite cheap, and it is a convenient way to drive Dasher. (We recommend the <emphasis>SmartNav3</emphasis> from NaturalPoint, which costs about $200, and works under microsoft windows only; this device used to be called the NavPoint TrackIR until 2002, when that brand name was transferred to a different device. We also recommend the Origin instruments <emphasis>Headmouse Extreme</emphasis>, which costs about $1000; it works as a USB mouse on any computer.) Can you waggle one finger or one foot? These head-mice can be used to track fingers and feet as well as heads. For a detailed comparison of SmartNav3 with Headmouse Extreme, please see <ulink url="http://www.inference.phy.cam.ac.uk/dasher/Headmouse.html" type="http">http://www.inference.phy.cam.ac.uk/dasher/Headmouse.html</ulink>.
sv: Kan du skapa en eller två kontinuerliga gester? Om du kan hantera en styrspak, mus, styrplatta eller styrkula kan du ha tvådimensionell kontroll. Om du kan trycka på en touch-skärm är det också bra. Kan du röra din näsa? Om du kan skaka ditt huvud är det endimensionell kontroll; om du kan nicka är det två. En huvudmus kan vara ganska billig, och det är ett bekvämt sätt att köra Dasher. (Vi rekommenderar <emphasis>SmartNav3</emphasis> från NaturalPoint, som kostar ca $200 och endast fungerar under Microsoft Windows; denna enhet brukade kallas NavPoint TrackIR fram tills 2002 när varumärkesnamnet flyttades till en annan enhet. Vi kan också rekommendera Origin instruments <emphasis>Headmouse extreme</emphasis> som kostar ca $1000; den kan fungera som USB-mus på alla datorer.) Kan du röra ett finger eller en fot? Dessa huvudmöss kan användas för att spåra fingrar och fötter såväl som huvuden. För en detaljerad jämförelse mellan SmartNav3 och Headmouse extreme, se <ulink url="http://www.inference.phy.cam.ac.uk/dasher/Headmouse.html" type="http">http://www.inference.phy.cam.ac.uk/dasher/Headmouse.html</ulink>.

source: If you are severely paralysed, the best option may be a gaze tracker. Do you have control of where your eyes are looking? With a gaze tracker we can write at 25 words per minute. Gaze trackers are quite expensive: we paid $2000 for the QuickGlance from EyeTech Digital Systems, and the Tobii eyetracker costs about $20,000. [We recommend both of these systems. You attach QuickGlance to an existing computer; Quickglance II costs about $4000. Tobii is a complete computer with built-in eyetracking cameras.] Dasher also works with the Eye response <emphasis>Erica</emphasis>, with LC's <emphasis>Eyegaze</emphasis>, and with Metrovision's gaze-tracker. All three of these systems are complete computers with eye-tracking cameras attached.
sv: Om du är allvarligt förlamad kan det bästa alternativet vara en ögonspårare. Har du kontroll över vart dina ögon ser? Med ögonspårning kan vi skriva 25 ord per minut. Ögonspårare är ganska dyra; vi betalade $2000 för QuickGlance från EyeTech Digital Systems, och Tobiis ögonspårare kostar ungefär $20 000. Vi rekommenderar båda dessa system. Du kan fästa QuickGlance vid en befintlig dator; QuickGlance II kostar ungefär $4000. Tobii är en komplett dator med inbyggda ögonspårningskameror.] Dasher fungerar också med Eye response <emphasis>Erica</emphasis>, med LC:s <emphasis>Eyegaze</emphasis> och med Metrovisions ögonspårare. Alla tre av dessa system är kompletta datorer med ögonspårningskameror fästa.

source: If joysticks, mice, rollerballs, and gaze trackers don't work, there may be a few other ways to convey a continuous one-dimensional signal. Lips and eyebrows should both work, though we don't know of any manufacturer selling appropriate devices. Breath is a one-dimensional signal too. If you can control your breath, it should be possible to make a breath mouse for you. We made our $22 breath mouse using a USB optical mouse, a belt, and some elastic, and our most experienced user can write at 15 words per minute by breath alone.
sv: Om styrspakar, möss, styrkulor och ögonspårare inte fungerar kan det finnas några andra sätt att överföra en kontinuerlig endimensionell signal på. Läppar och ögonbryn borde båda fungera, fast vi inte känner till någon tillverkare som säljer sådana enheter. Andning är också en endimensionell signal. Om du kan kontrollera din andning borde det vara möjligt att skapa en andningsmus åt dig. Vi skapade vår $22 andningsmus med en USB-optisk mus, ett bälte och lite gummisnodd, och vår mest erfarna användare kan skriva 15 ord i minuten med enbart andning.

source: Starting and stopping
sv: Start och stopp

source: There are several ways of starting and stopping Dasher. Pressing a button (for example, the left mouse button or the space bar) is one option. But if you can not press any buttons, it's possible to start and stop using only continuous gestures: in the options menu, select <quote>start on position</quote>; and switch on <quote>control mode</quote>;. When control mode is switched on, the Dasher alphabet includes a special Control node (a bit like an <computeroutput>Esc</computeroutput> key on a keyboard), within which various control functions are available. When you are inside the control node, Dasher moves more slowly than normal, for safety. The control node options include `pause' and `stop'. Use `pause' if you are half-way through writing something, and want to pause for a moment. Use `stop' when you have finished. <command>Pause</command> and <command>stop</command> produce the same behaviour, except <command>stop</command> may cause other automatic actions, such as `speak on stop', or `copy the text on stop'.
sv: Det finns flera olika sätt att starta och stoppa Dasher på. Att trycka ned en knapp (till exempel den vänstra musknappen eller mellanslag) är ett alternativ. Men om du inte kan trycka ned några knappar är det möjligt att starta och stoppa med endast kontinuerlig gester: i menyn för alternativ, välj <quote>starta vid position</quote>; och slå på <quote>styrningsläge</quote>;. När styrningsläge är aktiverat inkluderar Dasher-alfabetet en speciell kontrollnod (lite som tangenten <computeroutput>Esc</computeroutput> på ett tangentbord) inom vilka olika styrningsfunktioner finns tillgängliga. När du är inuti en kontrollnod, rör sig Dasher för säkerhets skull långsammare än normalt. Kontrollnodsalternativ omfattar ”paus” och ”stopp”. Använd ”paus” om du är halvvägs genom att skriva något och vill pausa en stund. Använd ”stopp” när du är klar. <command>Paus</command> och <command>stopp</command> ger samma beteende, förutom att <command>stopp</command> kan skapa andra automatiska åtgärder eller handlingar såsom ”läs upp vid stopp” eller ”kopiera texten vid stopp”.

source: When Dasher is paused or stopped, it can be restarted using any of the starting methods that are enabled. If `start on position' is enabled, then whenever Dasher is stopped a sequence of large targets will be displayed; you restart Dasher by pointing at (or looking at) the first (red) target, then the second (yellow) target. (We use two targets in sequence to make it difficult to start Dasher by accident.)
sv: När Dasher är pausad eller stoppad kan den startas om genom vilken startmetod som helst som är aktiverad. Om ”starta på position” är aktiverad kommer Dasher när det stoppas att visa en sekvens av måltavlor; du startar om Dasher genom att peka på (eller titta på) det första (röda) målet, sedan det andra (gula) målet. (Vi använder två mål i sekvens för att göra det svårt att starta Dasher av misstag.)

source: Recommendations for head-tracking
sv: Rekommendationer för huvudspårning

source: Many trackers have `smoothing' options, which determine the frequency with which the mouse position is updated; these options are normally used to smooth and damp down the mouse motion. For Dasher, we don't want such smoothing. We like instant, live, raw and jerky mouse coordinates. If there is a `smoothing' control, turn it right down.
sv: Många spårare har alternativ för ”utjämning” som avgör frekvensen för vilken muspositionen uppdateras; dessa alternativ är vanligtvis använda för att jämna ut och dämpa musrörelsen. För Dasher vill vi inte ha sådan utjämning. Vi gillar direkt skapade, råa och ryckiga muskoordinater. Om det finns en ”utjämnings”-kontroll, stäng av den.

source: The `gain' (sometimes called the `speed') of the head-tracker is also an important setting to adjust. Some trackers' gains can be adjusted in software. You can also adjust the gain by changing the geometry of your tracker: if you move the tracked dot from your forehead to the brim of a baseball cap, for example, then you roughly double the gain. Sitting closer to the tracker may also increase the gain. Find a gain setting that is comfortable. I like high gain because it allows me to steer with very small head motions.
sv: ”Förstärkning” (ibland kallad ”hastigheten”) av huvudspåraren är också en viktig inställning att justera. En del spårares förstärkning kan justeras i programmet. Du kan också justera förstärkningen genom att ändra geometrin för din spårare: om du flyttar den spårade pricken från din panna till exempel till kanten på en keps, behöver du nästan dubblera förstärkningen. Att sitta närmare spåraren kan också öka förstärkningen. Hitta en förstärkningsinställning som känns behaglig. Jag gillar hög förstärkning eftersom det låter mig styra med väldigt små huvudrörelser.

source: Recommendations for gaze-tracking
sv: Rekommendationer för ögonspårning

source: For good results with gaze trackers, we strongly recommend that the gaze-tracker be made to be as responsive as possible. Many trackers have `smoothing' options, which determine the frequency with which the mouse position is updated and the number of successive gaze images used to estimate the mouse position. These options are normally used to smooth and damp down the mouse motion. For Dasher, we don't want such smoothing. We like instant, live, raw and jerky mouse coordinates. When you are navigating, your eye moves very quickly to the target you are interested in, and we want Dasher to respond instantly. The ideal settings for Dasher may be very different from the ideal settings for other software. Ask your eyetracker manufacturer to make it easy to change the settings when switching application.
sv: För bra resultat med ögonspårning rekommenderar vi att ögonspåraren görs så responsiv som möjligt. Många spårare har ”utjämnings”-alternativ som avgör med vilken frekvens muspekaren uppdateras på för att avgöra muspositionen. Dessa alternativ används vanligtvis för att jämna ut och dämpa musrörelsen. I Dasher vill vi inte ha sådan utjämning. Vi vill ha direkt skapade, råa och ryckiga muskoordinater. När du navigerar flyttar sig dina ögon snabbt till målet du är intresserad av, och vi vill att Dasher ska svara snabbt. De ideala inställningarna för Dasher kan vara väldigt annorlunda från de bästa inställningarna för andra program. Be tillverkaren av ögonspåraren att göra det enkelt att ändra inställningar vid byte av program.

source: Dasher has several options designed for use with gaze-trackers. We recommend using <emphasis>eyetracker mode</emphasis> (under Options/Preferences/Control). In this mode, the dynamics of Dasher are slightly different from standard dynamics, making error-correction easier by gaze.
sv: Dasher har flera alternativ designade för användning med ögonspårare. Vi rekommenderar att använda <emphasis>ögonspårningsläge</emphasis> (under Alternativ/Inställningar/Styrning). I detta läge är dynamikerna i Dasher smått annorlunda än standarddynamiken, vilket gör felrättningen enklare med blick.

source: If your gaze-tracker's calibration drifts with time, for example when your head moves, then you should select the <emphasis>Autocalibrate eyetracker</emphasis> feature. When this feature is switched on, Dasher keeps track of your steering and infers the vertical calibration error, and corrects for it. You can see this correction taking effect by noticing the vertical offset between the mouse position as displayed by Dasher (by the tip of the red line) and the gaze-tracker's mouse position (shown by the system's mouse cursor).
sv: Om din ögonspårares kalibrering glider iväg med tiden, till exempel när ditt huvud rör på sig, bör du välja egenskapen <emphasis>Autokalibrera ögonspårning</emphasis>. När den här funktionen är påslagen håller Dasher koll på din styrning, uppskattar den vertikala kalibreringsavvikelsen och utför lämpliga justeringar. Du kan se justeringarna genom att försöka upptäcka den vertikala förskjutningen mellan muspositionen enligt Dasher (spetsen av den röda linjen) och ögonspårarens musposition (visas av systemets muspekare).

source: To avoid difficulties with the mouse being bounded by the top and bottom of the screen, we recommend choosing a window size for Dasher that is <emphasis>not</emphasis> full-screen in size. Place the Dasher window so that there is a margin above and below the Dasher canvas.
sv: För att undvika svårigheter med att musen begränsas överst och nederst av skärmen rekommenderar vi dig att välja en fönsterstorlek för Dasher som <emphasis>inte</emphasis> är av helskärmsstorlek. Placera Dasherfönstret så att det finns marginal ovan och under Dashers rityta.

source: <emphasis>Technical note:</emphasis> As well as through mouse emulation, Dasher is able to receive tracking information from gaze trackers, head trackers, or similar systems directly by means of a system socket. This option can be configured in the 'Input Device' section of the 'preferences' dialogue.
sv: <emphasis>Teknisk kommentar:</emphasis> Så väl som genom musemulering kan Dasher ta hand om spårningsinformation från ögonspårning, huvudspårning eller liknande system direkt genom ett systemuttag (socket). Detta alternativ kan konfigureras i avsnittet ”Inmatningsenhet” i dialogen inställningar.

source: Discrete Gestures
sv: Diskreta gester

source: We have several versions of <emphasis>button Dasher</emphasis>, available in Dasher Version 4.
sv: Vi har flera olika versioner av <emphasis>knappen Dasher</emphasis> tillgänglig i Dasher version 4.

source: Are time-critical gestures not an option?
sv: Är tidskritiska gester inte ett alternativ?

source: Some ways of conveying information make use of the <emphasis>timing</emphasis> of gestures. However, some people can't make gestures at a required instant. For example, spastics find it very difficult to do an action `exactly now!'
sv: En del sätt att förmedla information på använder <emphasis>tiden</emphasis> för gester. Men en del personer kan inte skapa gester vid en begärd tidpunkt. Till exempel kan personer med spastiska rörelse ha det svårt att utföra en åtgärd ”precis nu!”

source: If time-critical gestures are not an option, go to <xref linkend="no_time_critical"/>.
sv: Om tidskritiska gester inte är ett alternativ, gå till <xref linkend="no_time_critical"/>.

source: If you <emphasis>can</emphasis> convey information by <emphasis>precisely timed</emphasis> gestures, go to section <xref linkend="timed"/>.
sv: Om du <emphasis>kan</emphasis> förmedla information genom gester vid <emphasis>precisa tidpunkter</emphasis>, gå till avsnittet <xref linkend="timed"/>.

source: `Timeless' choices of Dasher
sv: ”Tidlösa” val i Dasher

source: If so, try <emphasis>click mode</emphasis>. Go to <xref linkend="time_critical_button"/>.
sv: I så fall, prova <emphasis>klickläge</emphasis>. Gå till <xref linkend="time_critical_button"/>.

source: Otherwise try <emphasis>direct button mode</emphasis> or <emphasis>menu button mode</emphasis>. Go to <xref linkend="no_time_critical_button"/>.
sv: Prova annars <emphasis>direktknappläge</emphasis> eller <emphasis>menyknappsläge</emphasis>. Gå till <xref linkend="no_time_critical_button"/>.

source: So, you want to steer Dasher at your own pace. Can you make fairly-accurate continuous gestures, given time? For example, can you position a pointer accurately on a screen, then press a button to indicate that you are ready? Or can you touch a touch-screen fairly accurately? <_:itemizedlist-1/>
sv: Så du vill styra Dasher i din egen fart? Kan du skapa hyfsat korrekta kontinuerliga gester om du erbjuds tillräcklig tid? Exempelvis, kan du positionera en pekare korrekt på en skärm och sedan trycka ned en knapp för att indikera att du är redo? Eller kan du trycka på en touch-skärm hyfsat korrekt? <_:itemizedlist-1/>

source: `Timeless' continuous Dasher: click mode
sv: ”Tidlös” kontinuerlig Dasher: klickläge

source: In <emphasis>click mode</emphasis>, you position the mouse pointer where you want to go, then press a button when you are ready. Dasher then zooms in on the position you chose.
sv: I <emphasis>klickläge</emphasis> positionerar du muspekaren dit du vill gå, och trycker sedan på en knapp när du är redo. Dasher zoomar sedan in på positionen du väljer.

source: Alternatively, if you have a touch screen, a single touch on the screen initiates a zoom to that position.
sv: Alternativt, om du har en touch-skärm kommer ett enkelt tryck på skärmen att initiera en zoom till den positionen.

source: `Timeless' choices of Button Dasher
sv: ”Tidlösa” val av knappar i Dasher

source: How many different switches, keys, or buttons can you easily operate?
sv: Hur många olika växlar, tangenter eller knappar kan du enkelt hantera?

source: With just one button, the only timeless way to convey information is by the <emphasis>duration</emphasis> of your button-presses. Can you make a distinction between short presses and long presses? If so, you can use <emphasis>menu button-Dasher</emphasis>. Connect up your short press to the `menu' action, and your long press to the `select' action.
sv: Med endast en knapp är det enda tidlösa sättet att förmedla information på genom <emphasis>tidlängd</emphasis> på dina knapptryck. Kan du skapa en distinktion med korta och långa tryck? I så fall, så kan du använda <emphasis>menyknapp-Dasher</emphasis>. Koppla ihop dina korta tryck till åtgärden ”meny” och dina långa tryck med åtgärden ”välj”.

source: You can use <emphasis>menu button-Dasher</emphasis>. Connect one button to the `menu' action, and the other to the `select' action. If one button is easier to press, make that button the `menu' button.
sv: Du kan använda <emphasis>menyknapp-Dasher</emphasis>. Anslut en knapp till åtgärden ”meny” och den andra till åtgärden ”välj“. Om en knapp är enklare att trycka ned, gör så att den knappen blir ”meny”-knappen.
