Repository: GNOME/dasher
Catalog: Data/Help/Gnome/*/*.po
Languages: sv

source: If you can easily press two buttons, and, for special occasions, you are able to press a third button, you can use <emphasis>menu button-Dasher</emphasis> or <emphasis>direct button-Dasher</emphasis>.
sv: Om du enkelt kan trycka ned två knappar, och vid speciella tillfällen, kan trycka ned en tredje knapp, kan du använda <emphasis>menyknapp-Dasher</emphasis> eller <emphasis>direktknapp-Dasher</emphasis>.

source: Set up <emphasis>menu button-Dasher</emphasis> as described above, and use the third button as your escape key -- to make Dasher go away, for example. [This feature is not currently provided within Dasher.]
sv: Ställ in <emphasis>menyknapp-Dasher</emphasis> som beskrivet ovan och använd den tredje knappen som din escape-tangent -- för att få Dasher att försvinna till exempel. [Denna egenskap finns för tillfället inte i Dasher.]

source: In <emphasis>direct button-Dasher</emphasis>, each button produces a particular navigation action such as `up', `down', or `back'. If you have 2.5 buttons, map the convenient two to `up' and `down', and the inconvenient button to `back'.
sv: I <emphasis>direktknapp-Dasher</emphasis> producerar varje knapp en speciell navigationsåtgärd som ”upp”, ”ned” eller ”bakåt”. Om du har 2.5 knappar, mappa de bekvämaste två till ”upp” och ”ned” och den obekväma knappen till ”bakåt”.

source: You can use <emphasis>direct button-Dasher</emphasis> or <emphasis>menu button-Dasher</emphasis> as described above.
sv: Du kan använda <emphasis>direktknapp-Dasher</emphasis> eller <emphasis>menyknapp-Dasher</emphasis> som beskrivet ovan.

source: 4, 5, 6, or 7
sv: 4, 5, 6 eller 7

source: With more than three buttons, you have the option to use <emphasis>direct button-Dasher</emphasis> with three, four, five, or six `forward' directions. Please try <emphasis>menu button-Dasher</emphasis> too, even though it uses only two buttons.
sv: Med fler än tre knappar har du möjlighet att använda <emphasis>direktknapp-Dasher</emphasis> med tre, fyra, fem eller sex ”framåt”-riktningar. Prova <emphasis>menyknapp-Dasher</emphasis> också, även om den använder endast två knappar.

source: 8 or more
sv: 8 eller mer

source: Try <emphasis>direct button-Dasher</emphasis> and <emphasis>menu button-Dasher</emphasis>. With this many buttons, you also have the option of using a system like T9 -- the predictive-text system found on many mobile phones. You may wish to investigate <emphasis>Tapir</emphasis>, a disambiguating on-screen keyboard from the developers of Dasher.
sv: Prova <emphasis>direktknapp-Dasher</emphasis> och <emphasis>menyknapp-Dasher</emphasis>. Med så många knappar har du också alternativet att använda ett system som T9 -- det förutsägande textsystemet som finns i många mobiltelefoner. Du borde kanske också testa <emphasis>Tapir</emphasis>, ett skärmtangentbord från Dasherutvecklarna.

source: Button Dashers that exploit timing
sv: Knapp-Dasher som använder tid

source: There are two Dasher modes which make use of precise timing information, and generally require fewer button presses than the nn-time-critical modes:
sv: Det finns två Dasher-lägen som använder precis tidinformation och rent allmänt kräver mindre knapptryck än nn-tidskritiska lägen:

source: (One button) dynamic mode
sv: (En knapp) dynamiskt läge

source: When started, Dasher will zoom towards a point towards the top or bottom of the display. A short button press will switch the point of zoom to the opposite side. Text can be entered by pressing the button when the desired phrase reaches the edge of the display.
sv: När startad kommer Dasher att zooma mot en punkt överst eller nederst i displayen. En kort knapptryckning kommer att växla punkt att zooma till motsatt sida. Text kan anges genom att trycka ned knappen när den önskade fasen når kanten på displayen.

source: Two button dynamic mode
sv: Två knappars dynamiskt läge

source: Dasher zooms continuously towards the centre of the screen, with the two buttons being used to shift the display up and down. The buttons should be pressed whenever the desired text is aligned with the two markers.
sv: Dasher zoomar kontinuerligt mot mitten av skärmen, med två knappar som används för att skifta display upp och nedåt. Knapparna ska tryckas ned närhelst den önskade texten justeras med de två markörerna.

source: Correcting errors
sv: Rätta fel

source: In either dynamic mode, there are three options for error correction: using an additional button, long presses or multiple presses. In all cases these actions will switch to a mode where Dasher unzooms at a fixed rate. In this mode, one more press will stop Dasher and a second press will return Dasher to forward zooming.
sv: I båda dynamiska lägen finns det tre alternativ för felrättning: att använda en ytterligare knapp, långa knapptryckningar eller flera tryck. I alla fallen kommer dessa åtgärder att byta till ett läge där Dasher zoomar ut i en konstant hastighet. I detta läge kommer ett tryck att stoppa Dasher och ett andra tryck kommer åter försätta Dasher i framåtzoomning.

source: Summary of Dasher Modes
sv: Sammanfattning av Dasher-lägen

source: The various modes of <application>Dasher</application> are listed below. The mode may be changed via the <emphasis> <quote>edit</quote> </emphasis> menu. Select <emphasis> <quote>Preferences</quote> </emphasis> and then <emphasis> <quote>Control</quote> </emphasis>. Each mode has a number of variable parameters associated with it which can be adjusted using the <emphasis>options</emphasis> button located below the mode menu.
sv: De olika lägena i <application>Dasher</application> listas nedan. Läget kan ändras via <emphasis> <quote>redigera</quote> </emphasis>-menyn. Välj <emphasis> <quote>Inställningar</quote> </emphasis> och sedan <emphasis> <quote>Styrning</quote> </emphasis>. Varje läge har ett antal variabla parametrar associerade med sig vilka kan justeras med <emphasis>alternativ</emphasis>-knappen placerad i lägesmenyn.

source: The original <application>Dasher</application> mode. Functions using a two dimensional steering gesture, from a mouse, say. A one-dimensional mode is also available, for those who may not be able to control two-dimensions, and a special eyetracker mode is available for those using Dasher with a gaze or head tracker. Dasher can be started using mouse position alone if clicking is not possible - select 'Start on Mouse Position' and 'Circle Start' to allow starting and stopping by dwelling in the circle in the centre of the display. The 'Two Box' start mode starts Dasher by dwelling in the two boxes in sequence. In the latter case stopping must be done through control mode.
sv: Det ursprungliga <application>Dasher</application>-läget. Funktioner använder en tvådimensionell styrgest, från t.ex. en mus. Ett endimensionellt läge är också tillgängligt för dem som inte kan kontrollera två dimensioner, och ett speciellt ögonspårningsläge är tillgängligt för dem som använder Dasher med syn- eller huvudspårare. Dasher kan startas med endast muspositioner om klick inte är möjligt -- välj ”Starta på musposition” och ”Cirkelstart” för att tillåta start och stopp genom hålla till i cirkeln i mitten av displayen. Startläget ”Två rutor” startar Dasher genom att hålla till i de två rutorna i sekvens. I det senare fallet måste stopp ske genom kontrolläge.

source: Click Mode
sv: Klickläge

source: In <emphasis>click mode</emphasis> you position the mouse pointer where you want to go, then press the button when you are ready. <application>Dasher</application> then zooms into the place where you clicked.
sv: I <emphasis>klickläge</emphasis> positionerar du muspekaren dit du vill gå, tryck sedan på knappen när du är redo. <application>Dasher</application> zoomar sedan dit du klickade.

source: Menu Mode
sv: Menyläge

source: One button is used to select a location, and once a second button is pressed <application>Dasher</application> zooms to that location. The large box occurring last in the cycle is used to zoom out.
sv: En knapp används för att välja en plats och när väl en andra knapp trycks ned zoomar <application>Dasher</application> till den platsen. Den stora rutan som visas sist i cykeln används för att zooma ut.

source: Direct Mode
sv: Direktläge

source: Direct mode is similar to menu mode, except boxes are assigned directly to each button rather than being selected in sequence.
sv: Direktläge liknar menyläge, förutom att rutor tilldelas till varje knapp direkt istället för att väljas i sekvens.

source: Compass Mode
sv: Kompassläge

source: Compass mode makes use of four buttons. Two buttons are used to control vertical position. When the required vertical position has been reached a third button is pressed to zoom in. After zooming in on the location, the user once more selects vertical position. A forth button zooms out if an error is made.
sv: Kompassläget använder fyra knappar. Två knappar används för att kontrollera vertikal position. När den begärda vertikala positionen har nåtts visas en tredje knapp för att zooma in. Efter att ha zoomat in på platsen får användaren välja vertikal position igen. En fjärde knapp zoomar ut om ett fel begås.

source: (One Button) Dynamic Mode
sv: (En knapp) Dynamiskt läge

source: <application>Dasher</application> continually zooms in and a single button may be used to move <quote>up</quote> and <quote>down</quote>. There is also a <emphasis>Two Button Dynamic Mode</emphasis> where two buttons are used to control motions <quote>up</quote> and <quote>down</quote>. A third button, long presses or multiple presses can be used to unzoom and correct errors.
sv: <application>Dasher</application> zoomar kontinuerligt in, och en enskild knapp kan användas för att flytta <quote>upp</quote> och <quote>ned</quote>. Det finns också ett <emphasis>Två knappars dynamiskt läge</emphasis> där två knappar används för att kontrollera rörelser <quote>upp</quote> och <quote>ned</quote>. En tredje knapp, långa tryck eller flera tryck kan användas för att zooma in och ut och rätta fel.

source: Two Button Dynamic Mode
sv: Tvåknappars dynamiskt läge

source: <application>Dasher</application> continually zooms in, whilst two buttons are used to control vertical motion. Correction is performed in the same way as One button dynamic mode.
sv: <application>Dasher</application> zoomar kontinuerligt in medan två knappar används för att kontrollera vertikal rörelse. Rättning utförs på samma sätt som i enknappars dynamiskt läge.

source: Authors
sv: Upphovsmän

source: <application>Dasher</application> was written by the members of The Dasher Project (<email>dasher@inf.phy.cam.ac.uk</email>). To find more information about it, please visit <application>Dasher's</application> <ulink url="http://www.inference.phy.cam.ac.uk/dasher/" type="http">Web page</ulink>. Please send all comments, suggestions, and bug reports to the <ulink url="http://bugzilla.gnome.org/enter_bug.cgi?product=dasher" type="http">GNOME bug tracking database</ulink>. Instructions for submitting bug reports can be found on-line at <ulink url="http://bugzilla.gnome.org/page.cgi?id=bug-writing.html" type="http"> http://bugzilla.gnome.org/page.cgi?id=bug-writing.html</ulink>. If you are using GNOME 1.1 or later, you can also use command <command>bug-buddy</command> for submitting bug reports.
sv: <application>Dasher</application> skapades av medlemmarna i Dasher-projektet (<email>dasher@inf.phy.cam.ac.uk</email>). För att få mer information besök <application>Dashers</application> <ulink url="http://www.inference.phy.cam.ac.uk/dasher/" type="http">webbplats</ulink>. Skicka kommentarer, förslag och felrapporter till <ulink url="http://bugzilla.gnome.org/enter_bug.cgi?product=dasher" type="http">GNOME:s felrapporteringsdatabas</ulink>. Instruktioner för att skicka in felrapporter kan hittas på nätet på <ulink url="http://bugzilla.gnome.org/page.cgi?id=bug-writing.html" type="http"> http://bugzilla.gnome.org/page.cgi?id=bug-writing.html</ulink>. Om du använder GNOME 1.1 eller senare kan du också använda kommandot <command>bug-buddy</command> för att lämna in felrapporter.

source: This manual was written by The Dasher Project (<email>dasher@inf.phy.cam.ac.uk</email>). Please send all comments and suggestions regarding the manual to the GNOME Documentation Project at <email>gnome-doc-list@gnome.org</email>.
sv: Den här handboken skrevs av Dasherprojektet (<email>dasher@inf.phy.cam.ac.uk</email>). Skicka alla kommentarer och förslag angående handboken till Dokumentationsprojekt för GNOME på <email>gnome-doc-list@gnome.org</email>.
