Repository: GNOME/dasher
Catalog: po/*.po
Languages: az

source: Predictive text entry
az: Proqnozlaşdırıcı mətn daxil etmə

source: Enter text without a keyboard
az: Klaviaturasız mətn daxil etmə

source: Centre circle
az: Mərkəz dairəsi

source: Two box
az: İki qutu

source: Dasher Preferences
az: Dasher Tərcihləri

source: Alphabet Selection
az: Əlifba Seçimi

source: Language Model
az: Dil Modeli

source: Standard letter-based PPM
az: Standart hərf əsaslı PPM

source: Word-based model
az: Söz əsaslı model

source: Mixture model (PPM/dictionary)
az: Qarışıq model (PPM/lüğət)

source: Japanese
az: Yapon

source: Adaptation
az: Uyğunlaşma

source: Language model adapts as you write.
az: Dil modeli yazdıqca uyğunlaşır.

source: Smoothing
az: Hamırlama

source: Use this control to adjust the relative sizes of the letter boxes. Note that selecting high values will slow your writing speed.
az: Bu idarəetmə vasitəsindən hərf qutularının nisbi ölçülərini tənzimləmək üçün istifadə edin. Qeyd edin ki, yüksək dəyərlər seçmək yazma sürətinizi yavaşlada bilər.

source: Direction
az: İstiqamət

source: Alphabet Default
az: Əlifba Defoltu

source: Always Left-to-Right
az: Həmişə Soldan-Sağa

source: Always Right-to-Left
az: Həmişə Sağdan-Sola

source: Always Top-to-Bottom
az: Həmişə Yuxarıdan-Aşağıya

source: Always Bottom-to-Top
az: Həmişə Aşağıdan-Yuxarıya

source: _Language
az: _Dil

source: Control Style
az: İdarəetmə Stili

source: Options
az: Seçimlər

source: Input Device
az: Daxiletmə Cihazı

source: Speed
az: Sürət

source: Adapt speed automatically
az: Sürəti avtomatik uyğunlaşdır

source: Starting and Stopping
az: Başlama və Dayandırma

source: Start on left mouse button
az: Sol siçan düyməsi ilə başla

source: Start on space bar
az: Boşluq düyməsi ilə başla

source: Start with mouse position:
az: Siçan mövqeyi ilə başla:

source: Pause outside of canvas
az: Kətan xaricində pauza et

source: C_ontrol
az: İ_darəetmə

source: Colour Scheme
az: Rəng Sxemi

source: Custom colour scheme:
az: Xüsusi rəng sxemi:

source: Appearance Options
az: Görünüş Seçimləri

source: Show mouse position
az: Siçan mövqeyini göstər

source: Draw line between crosshairs and mouse
az: Nişangahla siçan arasında xətt çək

source: Increase line thickness
az: Xətt qalınlığını artır

source: Draw box outlines
az: Qutu konturlarını çək

source: Dasher Font
az: Dasher Şrifti

source: Select Dasher Font
az: Dasher Şriftini Seç

source: Small font
az: Kiçik şrift

source: Large font
az: Böyük şrift

source: Very large font
az: Çox böyük şrift

source: _Appearance
az: _Görünüş

source: Application Options
az: Tətbiq Seçimləri

source: Timestamp new files
az: Yeni fayllara vaxt damğası vur

source: Show toolbar
az: Alətlər panelini göstər

source: Show speed slider
az: Sürət sürüşdürücüsünü göstər

source: Control mode
az: İdarəetmə rejimi

source: Copy All on stop
az: Dayanarkən hamısını kopyala

source: Speak All on stop
az: Dayanarkən hamısını səsləndir

source: Speak words as you write
az: Yazarkən sözləri səsləndir

source: Confirm unsaved files
az: Yadda saxlanılmamış faylları təsdiqlə

source: Editor Font
az: Redaktor Şrifti

source: Select Editor Font
az: Redaktor Şriftini Seç

source: Application Style
az: Tətbiq Stili

source: Stand-alone
az: Müstəqil

source: Composition
az: Kompozisiya

source: Direct entry
az: Birbaşa daxiletmə

source: Full Screen
az: Tam Ekran

source: A_pplication
az: T_ətbiq

source: _File
az: _Fayl

source: New file
az: Yeni fayl

source: Open file
az: Faylı aç

source: Save file
az: Faylı yadda saxla

source: Save file as
az: Faylı başqa adla yadda saxla

source: A_ppend to file…
az: Fayla ə_lavə et…

source: _Import Training Text…
az: Təlim Mətnini İdxal Et…

source: Quit
az: Çıx

source: _Edit
az: _Redaktə

source: Cut
az: Kəs

source: Copy
az: Kopyala

source: Copy _All
az: Hamısını _Kopyala

source: Paste
az: Yapışdır

source: Pr_eferences…
az: Tə_rcihlər…

source: Preferences
az: Tərcihlər

source: _Help
az: _Kömək

source: _Contents…
az: _Məzmun…

source: Help
az: Kömək

source: _About…
az: _Haqqında…

source: Direct Mode
az: Birbaşa Rejim

source: _Direct Mode
az: _Birbaşa Rejim

source: _Game Mode
az: _Oyun Rejimi

source: Speed:
az: Sürət:

source: Alphabet:
az: Əlifba:

source: Please Wait…
az: Zəhmət olmasa Gözləyin…

source: XML Error %s in file %s
az: XML Xətası %s faylda %s

source: File ends with incomplete UTF-8 character beginning 0x%x (expecting %i bytes but only %i)
az: Fayl natamam UTF-8 simvolu ilə bitir, başlanğıc 0x%x (%i bayt gözlənilir, amma yalnız %i)

source: Read invalid UTF-8 character 0x%x
az: Etibarsız UTF-8 simvolu oxundu 0x%x

source: Note: GameTextFile setting specifies game sentences file '%s' but this does not exist
az: Qeyd: GameTextFile parametri oyun cümlələri faylı '%s' göstərir, lakin bu fayl mövcud deyil

source: Frames over which to perform zoom
az: Yaxınlaşdırma aparmaq üçün kadrlar

source: Global keyboard grab
az: Qlobal klaviatura tutma

source: Alternating Direct Mode
az: Alternativ Birbaşa Rejim

source: Scan time in menu mode (0 to not scan)
az: Menyu rejimində skan vaxtı (skan etməmək üçün 0)

source: Number of forward boxes
az: İrəli qutuların sayı

source: Safety margin
az: Təhlükəsizlik marjası

source: Box non-uniformity
az: Qutu qeyri-bərabərliyi

source: Maximum Zoom
az: Maksimum Yaxınlaşdırma

source: Draw guides on screen to show area into which a click will zoom
az: Kliklə yaxınlaşdırılacaq sahəni göstərmək üçün ekranda bələdçilər çək

source: Curve lines to follow the non-linearity of the view transform
az: Görünüş transformasiyasının qeyri-xəttiliyini izləmək üçün xətləri əy

source: Click Mode
az: Klik Rejimi

source: Right zoom
az: Sağ yaxınlaşdırma

source: Compass Mode
az: Kompas Rejimi

source: Could not find game sentences file for %s - check alphabet definition, or override with GameTextFile setting
az: %s üçün oyun cümlələri faylı tapılmadı - əlifba tərifini yoxlayın və ya GameTextFile parametri ilə əvəz edin

source: Normal Control
az: Normal İdarəetmə

source: Menu Mode
az: Menyu Rejimi

source: Vertical distance from mouse/gaze to target (400=screen height)
az: Siçan/baxışdan hədəfə şaquli məsafə (400=ekran hündürlüyü)

source: Learn offset (previous) automatically, e.g. gazetrackers
az: Ofseti (əvvəlki) avtomatik öyrən, məsələn, baxış izləyiciləri

source: At top and bottom, scroll more and translate less (makes error-correcting easier)
az: Yuxarıda və aşağıda daha çox sürüşdür, daha az tərcümə et (səhv düzəltməni asanlaşdırır)

source: Screen geometry (mostly for tall thin screens) - 0=old-style, 1=square no-xhair, 2=squish, 3=squish+log
az: Ekran həndəsəsi (əsasən uzun nazik ekranlar üçün) - 0=köhnə stil, 1=kvadrat nişansız, 2=sıxışdırılmış, 3=sıxışdırılmış+log

source: Shape type: 0=disjoint rects, 1=overlapping, 2=triangles, 3=trunc-tris, 4=quadrics, 5=circles
az: Forma tipi: 0=ayrılmış düzbucaqlılar, 1=üst-üstə düşən, 2=üçbucaqlar, 3=kəsilmiş üçbucaqlar, 4=kəsrlər, 5=dairələr

source: Distance from right-hand-side Y-axis, at which maximum speed is reached. (2048=xhair)
az: Sağ tərəf Y-oxundan məsafə, burada maksimum sürətə çatılır. (2048=nişangah)

source: Hold right mouse button / key 1 to go 3/4 faster
az: Sağ siçan düyməsini / 1-ci düyməni tutaraq 3/4 daha sürətli get

source: Use exact computation of per-frame movement (slower)
az: Hər kadr hərəkətinin dəqiq hesablanmasını istifadə et (daha yavaş)

source: Demo Mode (no input)
az: Demo Rejimi (daxiletmə yoxdur)

source: Filename of sentences to enter
az: Daxil ediləcək cümlələrin fayl adı

source: Distance of sentence from center to decide user needs help
az: İstifadəçinin köməyə ehtiyacı olduğunu müəyyənləşdirmək üçün cümlənin mərkəzdən məsafəsi

source: Time for which user must need help before help drawn
az: İstifadəçinin köməyə ehtiyacı olduğu müddət, kömək göstərilməzdən əvvəl

source: When we give help, show the shortest path to the target sentence?
az: Kömək etdikdə, hədəf cümləyə ən qısa yolu göstər?

source: Warning: faulty alphabet definition: training-start delimiter %s must be a single unicode character. May be unable to process training file.
az: Xəbərdarlıq: qüsurlu əlifba tərifi: təlim-başlama ayırıcısı %s tək unikod simvolu olmalıdır. Təlim faylını emal etmək mümkün olmaya bilər.

source: Warning: training file contains character '%s' as member of group '%s', but no group of that name contains the character; ignoring group specifier
az: Xəbərdarlıq: təlim faylı '%s' simvolunu '%s' qrupunun üzvü kimi ehtiva edir, lakin bu adlı heç bir qrup bu simvolu ehtiva etmir; qrup təyinatçısı nəzərə alınmır

source: Warning: training file contains character '%s' as member of group '%s', but no group of that name contains the character. Dasher will not be able to learn how you want to write this character.
az: Xəbərdarlıq: təlim faylı '%s' simvolunu '%s' qrupunun üzvü kimi ehtiva edir, lakin bu adlı heç bir qrup bu simvolu ehtiva etmir. Dasher bu simvolu necə yazmaq istədiyinizi öyrənə bilməyəcək.

source: Warning: training file contains character '%s' as member of group '%s', but alphabet contains several such groups. Dasher will not be able to learn how you want to write this character.
az: Xəbərdarlıq: təlim faylı '%s' simvolunu '%s' qrupunun üzvü kimi ehtiva edir, lakin əlifbada bu cür bir neçə qrup var. Dasher bu simvolu necə yazmaq istədiyinizi öyrənə bilməyəcək.

source: Warning: in training file, annotation '<%s>' is followed by another annotation and will be ignored
az: Xəbərdarlıq: təlim faylında '<%s>' annotasiyası başqa bir annotasiya ilə izlənilir və nəzərə alınmayacaq

source: In file %s, the following %i symbol appeared without annotations saying how it should be entered, but it can be entered in several ways. Dasher will not be able to learn how you want to enter this symbol:
az: %s faylında aşağıdakı %i simvol necə daxil edilməli olduğuna dair annotasiyasız göründü, lakin bu bir neçə yolla daxil edilə bilər. Dasher bu simvolu necə daxil etmək istədiyinizi öyrənə bilməyəcək:

source: In file %s, the following %i symbols appeared without annotations saying how they should be entered, but each can be entered in several ways. Dasher will not be able to learn how you want to enter these symbols:
az: %s faylında aşağıdakı %i simvol necə daxil edilməli olduğuna dair annotasiyasız göründü, lakin hər biri bir neçə yolla daxil edilə bilər. Dasher bu simvolları necə daxil etmək istədiyinizi öyrənə bilməyəcək:

source: Training on User Text
az: İstifadəçi Mətnində Təlim

source: Training on System Text
az: Sistem Mətnində Təlim

source: No user training text found - if you have written in "%s" before, this means Dasher may not be learning from previous sessions
az: İstifadəçi təlim mətni tapılmadı - əgər əvvəllər "%s" ilə yazmısınızsa, bu, Dasherin əvvəlki seanslardan öyrənmədiyini bildirir

source: No training text (user or system) found for "%s". Dasher will still work but entry will be slower. We suggest downloading a training text file from the Dasher website, or constructing your own.
az: "%s" üçün təlim mətni (istifadəçi və ya sistem) tapılmadı. Dasher hələ də işləyəcək, lakin daxiletmə daha yavaş olacaq. Dasher veb saytından təlim mətni faylı yükləməyi və ya özünüzünkünü yaratmağı təklif edirik.

source: "%s" does not specify training file. Dasher will work but entry will be slower. Check you have the latest version of the alphabet definition.
az: "%s" təlim faylını təyin etmir. Dasher işləyəcək, lakin daxiletmə daha yavaş olacaq. Əlifba tərifinin ən son versiyasına malik olduğunuzu yoxlayın.

source: Long press time
az: Uzun basma vaxtı

source: Double-press time
az: İki dəfə basma vaxtı

source: Enable backoff button
az: Geri çəkilmə düyməsini aktivləşdir

source: Slow startup
az: Yavaş başlama

source: Startup time
az: Başlama vaxtı

source: Percentage by which to automatically increase speed
az: Sürəti avtomatik artırmaq üçün faiz

source: Time after which to automatically increase speed (secs)
az: Sürəti avtomatik artırmaq üçün vaxt (saniyə)

source: Percentage by which to decrease speed upon reverse
az: Geri dönərkən sürəti azaltmaq üçün faiz

source: One Button Dynamic Mode
az: Tək Düyməli Dinamik Rejim

source: Scan time (each direction), in ms
az: Skan vaxtı (hər istiqamətdə), ms ilə

source: Factor by which to zoom in
az: Yaxınlaşdırma faktoru

source: Lag before user actually pushes button (ms)
az: İstifadəçi düyməni basmazdan əvvəl gecikmə (ms)

source: One Dimensional Mode
az: Tək Ölçülü Rejim

source: Warning: training file contains character '%s' as member of group '%s', but no group of that name contains the character. Ignoring group specifier.
az: Xəbərdarlıq: təlim faylı '%s' simvolunu '%s' qrupunun üzvü kimi ehtiva edir, lakin bu adlı heç bir qrup bu simvolu ehtiva etmir. Qrup təyinatçısı nəzərə alınmır.

source: true
az: doğru

source: True
az: Doğru

source: false
az: yanlış

source: False
az: Yanlış

source: boolean value must be specified as 'true' or 'false'.
az: bool dəyəri 'doğru' və ya 'yanlış' kimi təyin edilməlidir.

source: unknown option, use "--help-options" for more information.
az: naməlum parametr, əlavə məlumat üçün "--help-options" istifadə edin.

source: X label:
az: X etiketi:

source: X maximum:
az: X maksimum:

source: Y label:
az: Y etiketi:

source: Y maximum:
az: Y maksimum:

source: Print socket-related debugging information to console:
az: Soketlə bağlı sazlama məlumatlarını konsola çap et:

source: Socket Input
az: Soket Daxiletmə

source: Error creating socket
az: Soket yaratma xətası

source: Error binding to socket - already in use?
az: Soketə bağlanma xətası - artıq istifadədədir?

source: Warning truncating socket input label '%s' to %i characters.
az: Xəbərdarlıq: soket daxiletmə etiketi '%s' %i simvola qədər kəsilir.

source: Socket input: Error reading from socket
az: Soket daxiletmə: Soketdən oxuma xətası

source: Dasher Socket Input error: %s: %s
az: Dasher Soket Daxiletmə xətası: %s: %s

source: Dasher socket input: failed to launch reader thread.
az: Dasher soket daxiletmə: oxuyucu axını başlatmaq alınmadı.

source: Max time for a 'tap' (anything longer is held)
az: 'Toxunma' üçün maksimum vaxt (daha uzun olan tutulur)

source: Stylus Control
az: Stilus İdarəetmə

source: Warning: faulty alphabet definition, escape sequence %s must be a single unicode character. This may worsen Dasher's text prediction.
az: Xəbərdarlıq: qüsurlu əlifba tərifi, qaçış ardıcıllığı %s tək unikod simvolu olmalıdır. Bu, Dasherin mətn proqnozlaşdırmasını pisləşdirə bilər.

source: Unable to open file "%s" for reading
az: "%s" faylını oxumaq üçün açmaq mümkün olmadı

source: Button offset
az: Düymə ofseti

source: Multiple press interval
az: Çoxsaylı basma intervalı

source: Enable backoff and start/stop buttons
az: Geri çəkilmə və başla/dayan düymələrini aktivləşdir

source: Reverse up and down buttons
az: Yuxarı və aşağı düymələri tərsinə çevir

source: Double-click is opposite up/down — triple to reverse
az: İki dəfə klik yuxarı/aşağı əksidir — tərsinə üç dəfə

source: Two Button Dynamic Mode
az: İki Düyməli Dinamik Rejim

source: Offset for outer (second) button
az: Xarici (ikinci) düymə üçün ofset

source: Distance between down markers (long gap)
az: Aşağı işarələr arasındakı məsafə (uzun boşluq)

source: Distance between up markers, as percentage of long gap
az: Yuxarı işarələr arasındakı məsafə, uzun boşluğun faizi kimi

source: Tolerance for inaccurate timing of button pushes (in ms)
az: Düymə basmalarının qeyri-dəqiq vaxtına dözümlülük (ms ilə)

source: Use push and release times of single press rather than push times of two presses
az: İki basma vaxtı əvəzinə tək basmanın basma və buraxma vaxtlarını istifadə et

source: Slow startup time
az: Yavaş başlama vaxtı

source: Two-push Dynamic Mode (New One Button)
az: İki Basma Dinamik Rejimi (Yeni Tək Düymə)

source: Boolean parameters
az: Bool parametrləri

source: Default
az: Defolt

source: Description
az: Təsvir

source: Integer parameters
az: Tam ədəd parametrləri

source: String parameters
az: Sətir parametrləri

source: Version
az: Versiya

source: License
az: Lisenziya

source: Select File
az: Fayl Seç

source: _Open
az: _Aç

source: _Cancel
az: _Ləğv et

source: _Save
az: _Yadda saxla

source: option setting is missing "=".
az: parametr təyinatında "=" işarəsi yoxdur.

source: Invalid option string specified
az: Etibarsız parametr sətri təyin edilib

source: Welcome to Dasher Game Mode! Game Mode is a fun way to practice entering text in Dasher. Please select a training text to play with:
az: Dasher Oyun Rejiminə Xoş Gəlmisiniz! Oyun Rejimi Dasherdə mətn daxil etməyi məşq etmək üçün əyləncəli bir yoldur. Zəhmət olmasa, oynamaq üçün təlim mətni seçin:

source: Use Default
az: Defoltu İstifadə Et

source: Choose File...
az: Fayl Seç...

source: Cancel
az: Ləğv et

source: Are you sure you wish to turn off game mode? All unsaved changes will be lost.
az: Oyun rejimini söndürmək istədiyinizə əminsinizmi? Yadda saxlanılmamış bütün dəyişikliklər itiriləcək.

source: No
az: Xeyr

source: Yes
az: Bəli

source: Do you want to save your changes to %s? Your changes will be lost if you don't save them.
az: %s üçün dəyişikliklərinizi yadda saxlamaq istəyirsinizmi? Əgər yadda saxlamasanız, dəyişiklikləriniz itiriləcək.

source: Do you want to save your changes? Your changes will be lost if you don't save them.
az: Dəyişikliklərinizi yadda saxlamaq istəyirsinizmi? Əgər yadda saxlamasanız, dəyişiklikləriniz itiriləcək.

source: Quit without saving
az: Yadda saxlamadan çıx

source: Don't quit
az: Çıxma

source: Save and quit
az: Yadda saxla və çıx

source: Are you sure you wish to quit?
az: Çıxmaq istədiyinizə əminsinizmi?

source: Unable to open help file
az: Kömək faylını açmaq mümkün olmadı

source: Dasher is a predictive text entry application
az: Dasher proqnozlaşdırıcı mətn daxiletmə tətbiqidir

source: translator-credits
az: tərcüməçi-təşəkkürlər

source: _Close
az: _Bağla

source: Dasher Module Options
az: Dasher Modul Seçimləri

source: %s Options:
az: %s Seçimləri:

source: Mouse Input
az: Siçan Daxiletmə

source: Pixels covering Y range
az: Y diapazonunu əhatə edən piksellər

source: One Dimensional Mouse Input
az: Tək Ölçülü Siçan Daxiletmə

source: Action
az: Hərəkət

source: Application style (traditional, direct, compose or fullscreen)
az: Tətbiq stili (ənənəvi, birbaşa, kompozisiya və ya tam ekran)

source: Override stored options
az: Saxlanılan parametrləri ləğv et

source: XML configuration file name
az: XML konfiqurasiya faylının adı

source: Describe "--options".
az: "--options" təsvir et.

source: Show the version details.
az: Versiya təfərrüatlarını göstər.

source: - A text input application honouring accessibility
az: - Əlçatanlığa hörmət edən mətn daxiletmə tətbiqi

source: Try 'dasher --help' for more information.
az: Əlavə məlumat üçün 'dasher --help' cəhd edin.
